{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "No_Label",
    "1": "Loaded_Language",
    "2": "Name_Calling-Labeling",
    "3": "Doubt",
    "4": "Repetition",
    "5": "Appeal_to_Fear-Prejudice",
    "6": "Flag_Waving",
    "7": "Exaggeration-Minimisation"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "is_decoder": false,
  "label2id": {
    "Appeal_to_Fear-Prejudice": 5,
    "Doubt": 3,
    "Exaggeration-Minimisation": 7,
    "Flag_Waving": 6,
    "Loaded_Language": 1,
    "Name_Calling-Labeling": 2,
    "No_Label": 0,
    "Repetition": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.4.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
